{
  "gb": 0,
  "t": 1,
  "1356": 2,
  "2001": 3,
  "1": 4,
  "25": 5,
  "5": 6,
  "2": 7,
  "3": 8,
  "4": 9,
  "6": 10,
  "8": 11,
  "10": 12,
  "12": 13,
  "16": 14,
  "20": 15,
  "32": 16,
  "40": 17,
  "50": 18,
  "15": 19,
  "ai": 20,
  "ml": 21,
  "cnn": 22,
  "95": 23,
  "rnn": 24,
  "lstm": 25,
  "齿轮": 26,
  "模数": 27,
  "是": 28,
  "设计": 29,
  "中": 30,
  "最": 31,
  "基本": 32,
  "的": 33,
  "参数": 34,
  "，": 35,
  "国家": 36,
  "标准": 37,
  "国家标准": 38,
  "GB": 39,
  "/": 40,
  "T": 41,
  "-": 42,
  "规定": 43,
  "了": 44,
  "系列": 45,
  "。": 46,
  "第": 47,
  "一系": 48,
  "一系列": 49,
  "包括": 50,
  "：": 51,
  ",": 52,
  "1.25": 53,
  "1.5": 54,
  "2.5": 55,
  "对于": 56,
  "软齿面": 57,
  "闭式": 58,
  "传动": 59,
  "主要": 60,
  "失效": 61,
  "形式": 62,
  "齿": 63,
  "面点": 64,
  "蚀": 65,
  "（": 66,
  "疲劳": 67,
  "）": 68,
  "应": 69,
  "按齿面": 70,
  "接触": 71,
  "强度": 72,
  "疲劳强度": 73,
  "按": 74,
  "齿根": 75,
  "弯曲": 76,
  "校核": 77,
  "硬齿面": 78,
  "开式": 79,
  "折断": 80,
  "高速": 81,
  "胶合": 82,
  "常见": 83,
  "之一": 84,
  "分为": 85,
  "热": 86,
  "重载": 87,
  "油膜": 88,
  "破裂": 89,
  "和": 90,
  "冷": 91,
  "低速": 92,
  "表面": 93,
  "直接": 94,
  "可以": 95,
  "通过": 96,
  "选择": 97,
  "合适": 98,
  "润滑": 99,
  "润滑油": 100,
  "、": 101,
  "极压": 102,
  "添加": 103,
  "加剂": 104,
  "添加剂": 105,
  "优化": 106,
  "齿廓": 107,
  "修": 108,
  "形来": 109,
  "预防": 110,
  "变位": 111,
  "系数": 112,
  "影响": 113,
  "齿面": 114,
  "正": 115,
  "增加": 116,
  "厚度": 117,
  "提高": 118,
  "约": 119,
  "25%": 120,
  "但": 121,
  "过": 122,
  "大": 123,
  "可能": 124,
  "导致": 125,
  "齿顶": 126,
  "变尖": 127,
  "AI": 128,
  "ML": 129,
  "技术": 130,
  "在": 131,
  "应用": 132,
  "正在": 133,
  "增长": 134,
  "神经": 135,
  "网络": 136,
  "神经网": 137,
  "神经网络": 138,
  "预测": 139,
  "寿命": 140,
  "遗传": 141,
  "算法": 142,
  "遗传算法": 143,
  "数字": 144,
  "孪生": 145,
  "实时": 146,
  "监控": 147,
  "齿轮箱": 148,
  "运行": 149,
  "状态": 150,
  "深度": 151,
  "学习": 152,
  "故障": 153,
  "诊断": 154,
  "故障诊断": 155,
  "CNN": 156,
  "识别": 157,
  "不同": 158,
  "类型": 159,
  "断齿": 160,
  "点蚀": 161,
  "磨损": 162,
  "准确": 163,
  "准确率": 164,
  "可达": 165,
  "95%": 166,
  "以上": 167,
  "RNN": 168,
  "LSTM": 169,
  "适用": 170,
  "于": 171,
  "时序": 172,
  "振动": 173,
  "数据": 174,
  "分析": 175,
  "数据分析": 176,
  "hrc58": 177,
  "62": 178,
  "一种": 179,
  "机械": 180,
  "装置": 181,
  "传动装置": 182,
  "由": 183,
  "轴": 184,
  "轴承": 185,
  "箱体": 186,
  "组成": 187,
  "减速": 188,
  "减速器": 189,
  "传动比": 190,
  "计算": 191,
  "需要": 192,
  "考虑": 193,
  "齿数": 194,
  "比": 195,
  "处理": 196,
  "热处理": 197,
  "工艺": 198,
  "对": 199,
  "性能": 200,
  "显著": 201,
  "渗碳": 202,
  "淬火": 203,
  "可": 204,
  "硬度": 205,
  "至": 206,
  "HRC58": 207,
  "氮化": 208,
  "耐磨": 209,
  "耐磨性": 210,
  ".": 211,
  "—": 212,
  "见于": 213,
  "常见于": 214,
  "引起": 215,
  "多见于": 216,
  "下": 217,
  "不良": 218,
  "维修": 219,
  "方法": 220,
  "轻微": 221,
  "继续": 222,
  "使用": 223,
  "需": 224,
  "定期": 225,
  "检查": 226,
  "定期检查": 227,
  "严重": 228,
  "更换": 229,
  "并": 230,
  "改善": 231,
  "必须": 232,
  "立即": 233,
  "相邻": 234,
  "是否": 235,
  "受损": 236,
  "spur": 237,
  "gear": 238,
  "helical": 239,
  "bevel": 240,
  "worm": 241,
  "module": 242,
  "m": 243,
  "pitch": 244,
  "diameter": 245,
  "number": 246,
  "of": 247,
  "teeth": 248,
  "pressure": 249,
  "angle": 250,
  "z": 251,
  "reference": 252,
  "d": 253,
  "f": 254,
  "b": 255,
  "n": 256,
  "y": 257,
  "s": 258,
  "45": 259,
  "hb": 260,
  "220": 261,
  "250": 262,
  "40cr": 263,
  "hrc": 264,
  "48": 265,
  "55": 266,
  "20crmnti": 267,
  "58": 268,
  "63": 269,
  "基础": 270,
  "知识": 271,
  "基础知识": 272,
  "元件": 273,
  "用于": 274,
  "传递": 275,
  "动力": 276,
  "运动": 277,
  "直": 278,
  "Spur": 279,
  "Gear": 280,
  "斜": 281,
  "Helical": 282,
  "锥齿轮": 283,
  "Bevel": 284,
  "蜗轮": 285,
  "蜗杆": 286,
  "Worm": 287,
  "关键": 288,
  "Module": 289,
  "=": 290,
  "压力": 291,
  "角": 292,
  "Pressure": 293,
  "Angle": 294,
  "标准值": 295,
  "°": 296,
  "Number": 297,
  "Teeth": 298,
  "分度": 299,
  "圆": 300,
  "直径": 301,
  "Reference": 302,
  "Diameter": 303,
  "*": 304,
  "公式": 305,
  "计算公式": 306,
  "σ": 307,
  "_": 308,
  "F": 309,
  "(": 310,
  "Y": 311,
  "S": 312,
  ")": 313,
  "其中": 314,
  ":": 315,
  "应力": 316,
  "弯曲应力": 317,
  "切向力": 318,
  "宽": 319,
  "法向": 320,
  "齿形": 321,
  "修正": 322,
  "材料": 323,
  "钢": 324,
  "调质": 325,
  "HB": 326,
  "40Cr": 327,
  "高频": 328,
  "HRC": 329,
  "20CrMnTi": 330,
  "faceted": 331,
  "classification": 332,
  "content": 333,
  "type": 334,
  "standard": 335,
  "case": 336,
  "study": 337,
  "design": 338,
  "trouble": 339,
  "shooting": 340,
  "data": 341,
  "record": 342,
  "method": 343,
  "concept": 344,
  "tool": 345,
  "news": 346,
  "discussion": 347,
  "original": 348,
  "document": 349,
  "personal": 350,
  "note": 351,
  "meeting": 352,
  "decision": 353,
  "plan": 354,
  "other": 355,
  "domain": 356,
  "udc": 357,
  "9": 358,
  "0": 359,
  "temporal": 360,
  "nature": 361,
  "evergreen": 362,
  "timeboxed": 363,
  "transient": 364,
  "epistemic": 365,
  "status": 366,
  "unverified": 367,
  "substantiated": 368,
  "corroborated": 369,
  "a": 370,
  "c": 371,
  "l2": 372,
  "l0": 373,
  "wlnk": 374,
  "weakest": 375,
  "link": 376,
  "r": 377,
  "eff": 378,
  "min": 379,
  "evidence": 380,
  "scores": 381,
  "hybrid": 382,
  "search": 383,
  "qwen3": 384,
  "embedding": 385,
  "4b": 386,
  "2560": 387,
  "cosine": 388,
  "bm25": 389,
  "bge": 390,
  "reranker": 391,
  "v2": 392,
  "m3": 393,
  "#": 394,
  "管理": 395,
  "核心": 396,
  "原则": 397,
  "##": 398,
  "分面": 399,
  "分类": 400,
  "分类法": 401,
  "Faceted": 402,
  "Classification": 403,
  "灵活": 404,
  "组织": 405,
  "方式": 406,
  "允许": 407,
  "单个": 408,
  "条目": 409,
  "同时": 410,
  "属于": 411,
  "多个": 412,
  "类别": 413,
  "###": 414,
  "1.1": 415,
  "四个": 416,
  "|": 417,
  "字段": 418,
  "字段名": 419,
  "枚举": 420,
  "值": 421,
  "------": 422,
  "--------": 423,
  "内容": 424,
  "领域": 425,
  "UDC": 426,
  "主类": 427,
  "时效": 428,
  "属性": 429,
  "认知": 430,
  "验证": 431,
  "1.2": 432,
  "搜索": 433,
  "场景": 434,
  "A": 435,
  "找": 436,
  "永久": 437,
  "有效": 438,
  "原理": 439,
  "性知识": 440,
  "→": 441,
  "B": 442,
  "有": 443,
  "价值": 444,
  "信息": 445,
  "C": 446,
  "只": 447,
  "看": 448,
  "已": 449,
  "L2": 450,
  "D": 451,
  "假设": 452,
  "L0": 453,
  "WLNK": 454,
  "Weakest": 455,
  "Link": 456,
  "信任": 457,
  "聚合": 458,
  "条": 459,
  "目的": 460,
  "总体": 461,
  "置信": 462,
  "信度": 463,
  "置信度": 464,
  "最弱": 465,
  "证据": 466,
  "决定": 467,
  "R": 468,
  "混合": 469,
  "检索": 470,
  "Hybrid": 471,
  "Search": 472,
  "结合": 473,
  "稠密": 474,
  "向量": 475,
  "语义": 476,
  "相似": 477,
  "度": 478,
  "稀疏": 479,
  "关键词": 480,
  "匹配": 481,
  "维": 482,
  "Cosine": 483,
  "距离": 484,
  "BM25": 485,
  "重": 486,
  "排序": 487,
  "15mm": 488,
  "20mm": 489,
  "7": 490,
  "30": 491,
  "手册": 492,
  "异响": 493,
  "现象": 494,
  "运转": 495,
  "时": 496,
  "发出": 497,
  "异常": 498,
  "噪音": 499,
  "\"": 500,
  "嗡嗡": 501,
  "声": 502,
  "或": 503,
  "咔": 504,
  "原因": 505,
  "间隙": 506,
  "超过": 507,
  "0.15": 508,
  "mm": 509,
  "剥落": 510,
  "目视": 511,
  "坑": 512,
  "不足": 513,
  "油位": 514,
  "低于": 515,
  "最低": 516,
  "刻度": 517,
  "线": 518,
  "加油": 519,
  "啮合": 520,
  "齿侧": 521,
  "0.12": 522,
  "0.20": 523,
  "步骤": 524,
  "停机": 525,
  "切勿": 526,
  "带病": 527,
  "！": 528,
  "记录": 529,
  "频率": 530,
  "工况": 531,
  "拆开": 532,
  "上盖": 533,
  "损坏": 534,
  "件": 535,
  "规范": 536,
  "重新": 537,
  "新装": 538,
  "装配": 539,
  "重新装配": 540,
  "注意": 541,
  "标记": 542,
  "加注": 543,
  "正常": 544,
  "空载": 545,
  "试运": 546,
  "试运行": 547,
  "分钟": 548,
  "确认": 549,
  "无异": 550,
  "响": 551,
  "漏油": 552,
  "体": 553,
  "外壳": 554,
  "有油": 555,
  "渗出": 556,
  "地面": 557,
  "油渍": 558,
  "油封": 559,
  "老化": 560,
  "建议": 561,
  "每": 562,
  "年": 563,
  "一次": 564,
  "砂眼": 565,
  "裂纹": 566,
  "渗透": 567,
  "检测": 568,
  "发现": 569,
  "缺陷": 570,
  "过多": 571,
  "不应": 572,
  "最高": 573,
  "呼吸": 574,
  "呼吸器": 575,
  "堵塞": 576,
  "清洗": 577,
  "保证": 578,
  "箱内": 579,
  "平衡": 580,
  "略": 581,
  "2026": 582,
  "q3": 583,
  "eq": 584,
  "001": 585,
  "03": 586,
  "07": 587,
  "002": 588,
  "04": 589,
  "06": 590,
  "003": 591,
  "05": 592,
  "08": 593,
  "004": 594,
  "01": 595,
  "09": 596,
  "005": 597,
  "设备": 598,
  "维护": 599,
  "计划": 600,
  "计划表": 601,
  "Q3": 602,
  "编号": 603,
  "名称": 604,
  "上次": 605,
  "下次": 606,
  "负责": 607,
  "责人": 608,
  "负责人": 609,
  "----------": 610,
  "EQ": 611,
  "数控": 612,
  "车床": 613,
  "数控车床": 614,
  "季度": 615,
  "保养": 616,
  "张工": 617,
  "测量": 618,
  "中心": 619,
  "校准": 620,
  "李工": 621,
  "三": 622,
  "坐标": 623,
  "测量机": 624,
  "王工": 625,
  "测试": 626,
  "测试台": 627,
  "换油": 628,
  "赵工": 629,
  "金": 630,
  "相": 631,
  "显微": 632,
  "显微镜": 633,
  "刘工": 634,
  "前": 635,
  "提前": 636,
  "天": 637,
  "通知": 638,
  "生产": 639,
  "部门": 640,
  "完成": 641,
  "后": 642,
  "填写": 643,
  "《": 644,
  "记录表": 645,
  "》": 646,
  "重大": 647,
  "隐患": 648,
  "上报": 649,
  "科长": 650
}